### DATAFRAME - TABLE

#### Series - Row and Column

In [2]:
import numpy as np
import pandas as pd

In [3]:
a = ["SAHIL", "HAPPY","UJWAL"]

In [5]:
a = pd.DataFrame(a)

In [6]:
a

       0
0  SAHIL
1  HAPPY
2  UJWAL

In [18]:
b = ["SAHIL", "HAPPY","UJWAL","Rohit"]

In [19]:
b = pd.DataFrame(b, index=["A","B","C","D"], columns=["Students"])

In [20]:
b

  Students
A    SAHIL
B    HAPPY
C    UJWAL
D    Rohit

In [21]:
type(b)

pandas.core.frame.DataFrame

In [22]:
type(b['Students'])

pandas.core.series.Series

#### Multipe series

In [23]:
names = ["SAHIL", "HAPPY","UJWAL"]
marks = [50, 20, 60]

In [24]:
pd.DataFrame([names, marks])

       0      1      2
0  SAHIL  HAPPY  UJWAL
1     50     20     60

In [25]:
pd.DataFrame(names, marks)

        0
50  SAHIL
20  HAPPY
60  UJWAL

In [26]:
# Dataframe (data = none, indexx: 'Axes / None' = None , column)

In [41]:
row1 = ["sahil",27, 'Businessman', 90.4]
row2 = ["happy",23, 'unemployed', 30.4]
row3 = ["ujwal",26, 'Teacher', 89.2]

In [42]:
a = [ row1,row2,row3]

In [43]:
b = np.array([row1,row2,row3])

In [44]:
a

[['sahil', 27, 'Businessman', 90.4],
 ['happy', 23, 'unemployed', 30.4],
 ['ujwal', 26, 'Teacher', 89.2]]

In [45]:
b

array([['sahil', '27', 'Businessman', '90.4'],
       ['happy', '23', 'unemployed', '30.4'],
       ['ujwal', '26', 'Teacher', '89.2']], dtype='<U32')

In [46]:
pd.DataFrame(a)

       0   1            2     3
0  sahil  27  Businessman  90.4
1  happy  23   unemployed  30.4
2  ujwal  26      Teacher  89.2

In [47]:
pd.DataFrame(b)

       0   1            2     3
0  sahil  27  Businessman  90.4
1  happy  23   unemployed  30.4
2  ujwal  26      Teacher  89.2

In [48]:
indexes = "A B C".split()

In [49]:
columns = "NAME AGE WORK HEIGHT".split()

In [52]:
df = pd.DataFrame(a, index = indexes, columns= columns)

In [53]:
df

    NAME  AGE         WORK  HEIGHT
A  sahil   27  Businessman    90.4
B  happy   23   unemployed    30.4
C  ujwal   26      Teacher    89.2

#### PUTTING DATA THROUGH DICTIONARY

In [70]:
d = {
    1:["sahil" , 20 , 'netmax', 63.6],
    2:["happy" , 40 , 'dev', 70.2],
    3:["ujala" , 25 , 'data', 53.6]
    }

In [71]:
pd.DataFrame(d)

        1      2      3
0   sahil  happy  ujala
1      20     40     25
2  netmax    dev   data
3    63.6   70.2   53.6

In [76]:
d = {
    "name":["sahil" , "happy" , "ujala"],
    "age": [20,25,30],
    "weight": [71.4,53.2,60.3]   
}

In [77]:
pd.DataFrame(d)

    name  age  weight
0  sahil   20    71.4
1  happy   25    53.2
2  ujala   30    60.3

In [78]:
pd.DataFrame(d, index=range(100,103))

      name  age  weight
100  sahil   20    71.4
101  happy   25    53.2
102  ujala   30    60.3